app/controllers/authentications_controller.rb

  def register
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "admin@admin.com"], ["password_digest", "$2a$10$NZBjhwgDYiJ9HMQvTRdWV.35ynVCho.m09F/z05SaBbtNXsHBEKxi"], ["created_at", 2017-02-16 12:38:33 UTC], ["updated_at", 2017-02-16 12:38:33 UTC]]