app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "game_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["game_id", 1], ["body", "This is what I think"], ["created_at", 2017-02-23 12:05:01 UTC], ["updated_at", 2017-02-23 12:05:01 UTC]]
---
  def create
    @comment = current_user.comments.new(comment_params)

    if @comment.save