app/controllers/libraries_controller.rb

INSERT INTO "libraries" ("user_id", "game_id", "played", "owned", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["game_id", 1], ["played", true], ["owned", false], ["created_at", 2017-02-21 15:30:33 UTC], ["updated_at", 2017-02-21 15:30:33 UTC]]
---
  def create
    @library = Library.new(library_params)

    if @library.save

UPDATE "libraries" SET "played" = $1, "owned" = $2, "updated_at" = $3 WHERE "libraries"."id" = $4  [["played", true], ["owned", true], ["updated_at", 2017-02-22 18:20:31 UTC], ["id", 2]]
---
  def update
    if @library.update(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_library
      @library = Library.find(params[:id])